'''Ця функція виконує ряд завдань: заповнення текстового документу,
вивід з текстового документу строк, які нам потрібні двома шляхами 
завдяки циклам'''


h = open("E:\ICS-123\my_file\my_file.txt", 'w+')
'''Ця функція під'єднує текстовий файл до програми 
та додає функцію писати у ньому'''
i = 1
for i in range(10):

    h.write(str(i) + " строка\n")

    i + 1
    '''Це цикл, який заповнює 10 строк у текстовому документі'''

h.close()
'''Завершення роботи з текстовим документом'''

b = open("E:\ICS-123\my_file\myfile.txt", 'r')
'''Ця функція під'єднує текстовий файл до програми 
та додає функцію читати елементи, що знаходяться у документі'''
slist = []
k = 0
for k in range (5):
    stroka = b.readlines(k)
    slist.append(stroka)
    print(slist[k])
    k+1
    '''Цикл, що читає строки з текстового документу та додає їх у список,
    щоб вивести їх у подальшому на екрані'''
b.close()

print('__')

with open("E:\ICS-123\my_file\my_file.txt") as sf:
    file = sf.readlines()
print(file)
'''Функція, що робить те ж саме, що й минула, але 
із застосуванням менеджера контенту'''